BNKMMP  DFHMSD TYPE=MAP,                                               X
               MODE=INOUT,                                             X
               TERM=ALL,                                               X
               LANG=COBOL,                                             X
               STORAGE=AUTO,                                           X
               TIOAPFX=YES,                                            X
               MAPATTS=(COLOR,HILIGHT),                                X
               DSATTS=(COLOR,HILIGHT),                                 X
               CTRL=(FREEKB,FRSET)
BNKMAPM  DFHMDI SIZE=(24,80),                                          X
               LINE=1,                                                 X
               COLUMN=1,                                               X
               COLOR=BLUE,                                             X
               MAPATTS=(COLOR,HILIGHT),                                X
               DSATTS=(COLOR,HILIGHT)
TITULO   DFHMDF POS=(02,20),                                           X
               LENGTH=40,                                              X
               ATTRB=(PROT,BRT),                                       X
               COLOR=GREEN,                                            X
               INITIAL='=== MENU PRINCIPAL DEL BANCO ==='
LBLUSER  DFHMDF POS=(04,10),                                           X
               LENGTH=20,                                              X
               ATTRB=(PROT),                                           X
               COLOR=YELLOW,                                           X
               INITIAL='USUARIO CONECTADO:'
NOMBREUS DFHMDF POS=(04,31),                                           X
               LENGTH=10,                                              X
               ATTRB=(PROT,BRT)
LINEA2   DFHMDF POS=(05,01),                                           X
               LENGTH=80,                                              X
               ATTRB=(PROT),                                           X
               INITIAL='-----------------------------------------------X
               --------------------------------'
OPC1LBL  DFHMDF POS=(07,10),                                           X
               LENGTH=35,                                              X
               ATTRB=(PROT),                                           X
               INITIAL='1 - CONSULTA, RETIRO Y DEPOSITO'
OPC2LBL  DFHMDF POS=(08,10),                                           X
               LENGTH=35,                                              X
               ATTRB=(PROT),                                           X
               INITIAL='2 - TRANSFERENCIA ENTRE CUENTAS'
OPC3LBL  DFHMDF POS=(09,10),                                           X
               LENGTH=35,                                              X
               ATTRB=(PROT),                                           X
               INITIAL='3 - VER HISTORIAL DE ACCIONES'
LINEA3   DFHMDF POS=(12,01),                                           X
               LENGTH=80,                                              X
               ATTRB=(PROT),                                           X
               INITIAL='-----------------------------------------------X
               --------------------------------'
PREGUNTA DFHMDF POS=(14,10),                                           X
               LENGTH=20,                                              X
               ATTRB=(PROT),                                           X
               COLOR=YELLOW,                                           X
               INITIAL='Seleccione opcion :'
OPCION   DFHMDF POS=(14,31),                                           X
               LENGTH=1,                                               X
               ATTRB=(UNPROT,NUM,IC),                                  X
               COLOR=NEUTRAL
MSG      DFHMDF POS=(16,10),                                           X
               LENGTH=60,                                              X
               ATTRB=(PROT,BRT),                                       X
               COLOR=RED
LEYENDA  DFHMDF POS=(23,10),                                           X
               LENGTH=60,                                              X
               ATTRB=(PROT),                                           X
               COLOR=GREEN,                                            X
               INITIAL='PF3/ENTER -> CONTINUAR - PF12 -> CERRAR SESION'
         DFHMSD TYPE=FINAL
         END
