BNKHMP   DFHMSD TYPE=MAP,MODE=INOUT,TERM=ALL,LANG=COBOL,STORAGE=AUTO,  X
               TIOAPFX=YES,MAPATTS=(COLOR,HILIGHT),                    X
               DSATTS=(COLOR,HILIGHT),CTRL=(FREEKB,FRSET)

BNKMAPH  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,COLOR=BLUE,               X
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)

TITULO   DFHMDF POS=(02,24),LENGTH=32,ATTRB=(PROT,BRT),COLOR=GREEN,    X
               INITIAL='=== HISTORIAL DE OPERACIONES ==='

LBLUSER  DFHMDF POS=(04,02),LENGTH=08,ATTRB=(PROT),COLOR=YELLOW,       X
               INITIAL='USUARIO:'
NOMBREUS DFHMDF POS=(04,11),LENGTH=10,ATTRB=(PROT),COLOR=NEUTRAL

LBLSALDO DFHMDF POS=(04,45),LENGTH=07,ATTRB=(PROT),COLOR=YELLOW,       X
               INITIAL='SALDO: '
SALDO    DFHMDF POS=(04,53),LENGTH=15,ATTRB=(PROT),                    X
               PICOUT='$$$,$$$,$$9.99',COLOR=NEUTRAL

LIN1     DFHMDF POS=(05,01),LENGTH=79,ATTRB=(PROT),COLOR=NEUTRAL,      X
               INITIAL='-----------------------------------------------X
               --------------------------------'

         DFHMDF POS=(06,02),LENGTH=28,ATTRB=(PROT),COLOR=TURQUOISE,    X
               INITIAL='FILTRAR TIPO OPERACION (*): '

         DFHMDF POS=(06,31),LENGTH=09,ATTRB=(PROT),INITIAL='DEPOSITO:'
SELDEP   DFHMDF POS=(06,41),LENGTH=02,ATTRB=(UNPROT,FSET),             X
               COLOR=NEUTRAL

         DFHMDF POS=(06,45),LENGTH=07,ATTRB=(PROT),INITIAL='RETIRO:'
SELRET   DFHMDF POS=(06,53),LENGTH=02,ATTRB=(UNPROT,FSET),             X
               COLOR=NEUTRAL

         DFHMDF POS=(06,57),LENGTH=07,ATTRB=(PROT),INITIAL='RECIBO:'
SELREC   DFHMDF POS=(06,65),LENGTH=02,ATTRB=(UNPROT,FSET),             X
               COLOR=NEUTRAL

         DFHMDF POS=(06,69),LENGTH=06,ATTRB=(PROT),INITIAL='TRANS:'
SELTRN   DFHMDF POS=(06,76),LENGTH=02,ATTRB=(UNPROT,FSET),             X
               COLOR=NEUTRAL

         DFHMDF POS=(07,02),LENGTH=35,ATTRB=(PROT),COLOR=TURQUOISE,    X
               INITIAL='FILTRAR POR FECHA (A=ASC, D=DESC):'
FILORD   DFHMDF POS=(07,38),LENGTH=02,ATTRB=(UNPROT,IC,FSET),          X
               COLOR=NEUTRAL

LIN2     DFHMDF POS=(08,01),LENGTH=79,ATTRB=(PROT),COLOR=NEUTRAL,      X
               INITIAL='===============================================X
               ================================'

HD_TIPO  DFHMDF POS=(09,03),LENGTH=14,ATTRB=(PROT,BRT),COLOR=YELLOW,   X
               INITIAL='TIPO OPERACION'
HD_MTO   DFHMDF POS=(09,20),LENGTH=12,ATTRB=(PROT,BRT),COLOR=YELLOW,   X
               INITIAL='       MONTO'
HD_USR   DFHMDF POS=(09,37),LENGTH=12,ATTRB=(PROT,BRT),COLOR=YELLOW,   X
               INITIAL='USUARIO REL.'
HD_FEC   DFHMDF POS=(09,52),LENGTH=10,ATTRB=(PROT,BRT),COLOR=YELLOW,   X
               INITIAL='  FECHA   '

MUP      DFHMDF POS=(09,78),LENGTH=02,ATTRB=(PROT,BRT,MDT),COLOR=GREEN

TYP1     DFHMDF POS=(10,03),LENGTH=15,ATTRB=(PROT),COLOR=NEUTRAL
MTO1     DFHMDF POS=(10,20),LENGTH=14,ATTRB=(PROT),
REL1     DFHMDF POS=(10,37),LENGTH=12,ATTRB=(PROT),COLOR=NEUTRAL
FEC1     DFHMDF POS=(10,52),LENGTH=11,ATTRB=(PROT),COLOR=NEUTRAL

TYP2     DFHMDF POS=(11,03),LENGTH=15,ATTRB=(PROT),COLOR=NEUTRAL
MTO2     DFHMDF POS=(11,20),LENGTH=14,ATTRB=(PROT),
REL2     DFHMDF POS=(11,37),LENGTH=12,ATTRB=(PROT),COLOR=NEUTRAL
FEC2     DFHMDF POS=(11,52),LENGTH=11,ATTRB=(PROT),COLOR=NEUTRAL

TYP3     DFHMDF POS=(12,03),LENGTH=15,ATTRB=(PROT),COLOR=NEUTRAL
MTO3     DFHMDF POS=(12,20),LENGTH=14,ATTRB=(PROT),
REL3     DFHMDF POS=(12,37),LENGTH=12,ATTRB=(PROT),COLOR=NEUTRAL
FEC3     DFHMDF POS=(12,52),LENGTH=11,ATTRB=(PROT),COLOR=NEUTRAL

TYP4     DFHMDF POS=(13,03),LENGTH=15,ATTRB=(PROT),COLOR=NEUTRAL
MTO4     DFHMDF POS=(13,20),LENGTH=14,ATTRB=(PROT),
REL4     DFHMDF POS=(13,37),LENGTH=12,ATTRB=(PROT),COLOR=NEUTRAL
FEC4     DFHMDF POS=(13,52),LENGTH=11,ATTRB=(PROT),COLOR=NEUTRAL

MDOWN    DFHMDF POS=(18,78),LENGTH=02,ATTRB=(PROT,BRT,MDT),COLOR=GREEN
MSG      DFHMDF POS=(22,02),LENGTH=77,ATTRB=(PROT,MDT),COLOR=RED

LEYEND1  DFHMDF POS=(23,01),LENGTH=79,ATTRB=(PROT,ASKIP),COLOR=GREEN,  X
               INITIAL='F3=MENU  F5=CAMBIAR FILTRO  F7=SUBIR AL INICIO X
                F8=BAJAR'
LEYEND2  DFHMDF POS=(24,01),LENGTH=79,ATTRB=(PROT,ASKIP),COLOR=GREEN,  X
               INITIAL='F10=CAMBIAR ASC/DESC  F11=RESETEAR FILTROS'
         DFHMSD TYPE=FINAL
         END

