BNKTMP   DFHMSD TYPE=MAP,                                              X
               MODE=INOUT,                                             X
               TERM=ALL,                                               X
               LANG=COBOL,                                             X
               STORAGE=AUTO,                                           X
               TIOAPFX=YES,                                            X
               MAPATTS=(COLOR,HILIGHT),                                X
               DSATTS=(COLOR,HILIGHT),                                 X
               CTRL=(FREEKB,FRSET)
BNKMAPT  DFHMDI SIZE=(24,80),                                          X
               LINE=1,                                                 X
               COLUMN=1,                                               X
               COLOR=BLUE,                                             X
               MAPATTS=(COLOR,HILIGHT),                                X
               DSATTS=(COLOR,HILIGHT)
TITULO   DFHMDF POS=(02,22),                                           X
               LENGTH=35,                                              X
               ATTRB=(PROT,BRT),                                       X
               COLOR=GREEN,                                            X
               INITIAL='=== TRANSFERENCIA DE FONDOS ==='
LBLUSER  DFHMDF POS=(04,05),                                           X
               LENGTH=18,                                              X
               ATTRB=(PROT),                                           X
               COLOR=YELLOW,                                           X
               INITIAL='USUARIO CONECTADO:'
NOMBREUS DFHMDF POS=(04,25),                                           X
               LENGTH=10,                                              X
               ATTRB=(PROT,BRT),                                       X
               COLOR=NEUTRAL
LBLSALDO DFHMDF POS=(04,45),                                           X
               LENGTH=15,                                              X
               ATTRB=(PROT),                                           X
               COLOR=YELLOW,                                           X
               INITIAL='SALDO ACTUAL :$'
SALDO    DFHMDF POS=(04,61),                                           X
               LENGTH=15,                                              X
               ATTRB=(PROT,BRT),                                       X
               PICOUT='$$$,$$$,$$9.99',                                X
               COLOR=NEUTRAL
LINEA2   DFHMDF POS=(05,01),                                           X
               LENGTH=80,                                              X
               ATTRB=(PROT),                                           X
               INITIAL='-----------------------------------------------X
               --------------------------------'
LBLDEST  DFHMDF POS=(08,15),                                           X
               LENGTH=20,                                              X
               ATTRB=(PROT),                                           X
               COLOR=YELLOW,                                           X
               INITIAL='USUARIO DESTINO   :'
USRDEST  DFHMDF POS=(08,36),                                           X
               LENGTH=08,                                              X
               ATTRB=(UNPROT,IC,FSET),                                 X
               COLOR=NEUTRAL
LBLMONTO DFHMDF POS=(10,15),                                           X
               LENGTH=20,                                              X
               ATTRB=(PROT),                                           X
               COLOR=YELLOW,                                           X
               INITIAL='MONTO A TRANSFERIR:'
MONTO    DFHMDF POS=(10,36),                                           X
               LENGTH=12,                                              X
               ATTRB=(UNPROT,NUM,FSET),                                X
               PICIN='999999999999',                                   X
               COLOR=NEUTRAL
CONFRM   DFHMDF POS=(18,05),                                           X
               LENGTH=70,                                              X
               ATTRB=(PROT,BRT),                                       X
               COLOR=TURQUOISE
MSG      DFHMDF POS=(20,10),                                           X
               LENGTH=60,                                              X
               ATTRB=(PROT,BRT),                                       X
               COLOR=RED
LINEA3   DFHMDF POS=(22,01),                                           X
               LENGTH=80,                                              X
               ATTRB=(PROT),                                           X
               INITIAL='-----------------------------------------------X
               --------------------------------'
LEYENDA  DFHMDF POS=(23,10),                                           X
               LENGTH=60,                                              X
               ATTRB=(PROT),                                           X
               COLOR=GREEN,                                            X
               INITIAL='ENTER->CONFIRMAR TRANSFERENCIA PF3->VOLVER'
         DFHMSD TYPE=FINAL
         END
