       01  BNKMAPHI.
           02  FILLER PIC X(12).
           02  TITULOL    COMP  PIC  S9(4).
           02  TITULOF    PICTURE X.
           02  FILLER REDEFINES TITULOF.
             03 TITULOA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  TITULOI  PIC X(32).
           02  LBLUSERL    COMP  PIC  S9(4).
           02  LBLUSERF    PICTURE X.
           02  FILLER REDEFINES LBLUSERF.
             03 LBLUSERA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LBLUSERI  PIC X(8).
           02  NOMBREUSL    COMP  PIC  S9(4).
           02  NOMBREUSF    PICTURE X.
           02  FILLER REDEFINES NOMBREUSF.
             03 NOMBREUSA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  NOMBREUSI  PIC X(10).
           02  LBLSALDOL    COMP  PIC  S9(4).
           02  LBLSALDOF    PICTURE X.
           02  FILLER REDEFINES LBLSALDOF.
             03 LBLSALDOA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LBLSALDOI  PIC X(7).
           02  SALDOL    COMP  PIC  S9(4).
           02  SALDOF    PICTURE X.
           02  FILLER REDEFINES SALDOF.
             03 SALDOA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  SALDOI  PIC X(15).
           02  LIN1L    COMP  PIC  S9(4).
           02  LIN1F    PICTURE X.
           02  FILLER REDEFINES LIN1F.
             03 LIN1A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LIN1I  PIC X(79).
           02  SELDEPL    COMP  PIC  S9(4).
           02  SELDEPF    PICTURE X.
           02  FILLER REDEFINES SELDEPF.
             03 SELDEPA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  SELDEPI  PIC X(2).
           02  SELRETL    COMP  PIC  S9(4).
           02  SELRETF    PICTURE X.
           02  FILLER REDEFINES SELRETF.
             03 SELRETA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  SELRETI  PIC X(2).
           02  SELRECL    COMP  PIC  S9(4).
           02  SELRECF    PICTURE X.
           02  FILLER REDEFINES SELRECF.
             03 SELRECA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  SELRECI  PIC X(2).
           02  SELTRNL    COMP  PIC  S9(4).
           02  SELTRNF    PICTURE X.
           02  FILLER REDEFINES SELTRNF.
             03 SELTRNA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  SELTRNI  PIC X(2).
           02  FILORDL    COMP  PIC  S9(4).
           02  FILORDF    PICTURE X.
           02  FILLER REDEFINES FILORDF.
             03 FILORDA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  FILORDI  PIC X(2).
           02  LIN2L    COMP  PIC  S9(4).
           02  LIN2F    PICTURE X.
           02  FILLER REDEFINES LIN2F.
             03 LIN2A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LIN2I  PIC X(79).
           02  HD_TIPOL    COMP  PIC  S9(4).
           02  HD_TIPOF    PICTURE X.
           02  FILLER REDEFINES HD_TIPOF.
             03 HD_TIPOA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  HD_TIPOI  PIC X(14).
           02  HD_MTOL    COMP  PIC  S9(4).
           02  HD_MTOF    PICTURE X.
           02  FILLER REDEFINES HD_MTOF.
             03 HD_MTOA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  HD_MTOI  PIC X(12).
           02  HD_USRL    COMP  PIC  S9(4).
           02  HD_USRF    PICTURE X.
           02  FILLER REDEFINES HD_USRF.
             03 HD_USRA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  HD_USRI  PIC X(12).
           02  HD_FECL    COMP  PIC  S9(4).
           02  HD_FECF    PICTURE X.
           02  FILLER REDEFINES HD_FECF.
             03 HD_FECA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  HD_FECI  PIC X(10).
           02  MUPL    COMP  PIC  S9(4).
           02  MUPF    PICTURE X.
           02  FILLER REDEFINES MUPF.
             03 MUPA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MUPI  PIC X(2).
           02  TYP1L    COMP  PIC  S9(4).
           02  TYP1F    PICTURE X.
           02  FILLER REDEFINES TYP1F.
             03 TYP1A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  TYP1I  PIC X(15).
           02  MTO1L    COMP  PIC  S9(4).
           02  MTO1F    PICTURE X.
           02  FILLER REDEFINES MTO1F.
             03 MTO1A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MTO1I  PIC X(14).
           02  REL1L    COMP  PIC  S9(4).
           02  REL1F    PICTURE X.
           02  FILLER REDEFINES REL1F.
             03 REL1A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  REL1I  PIC X(12).
           02  FEC1L    COMP  PIC  S9(4).
           02  FEC1F    PICTURE X.
           02  FILLER REDEFINES FEC1F.
             03 FEC1A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  FEC1I  PIC X(11).
           02  TYP2L    COMP  PIC  S9(4).
           02  TYP2F    PICTURE X.
           02  FILLER REDEFINES TYP2F.
             03 TYP2A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  TYP2I  PIC X(15).
           02  MTO2L    COMP  PIC  S9(4).
           02  MTO2F    PICTURE X.
           02  FILLER REDEFINES MTO2F.
             03 MTO2A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MTO2I  PIC X(14).
           02  REL2L    COMP  PIC  S9(4).
           02  REL2F    PICTURE X.
           02  FILLER REDEFINES REL2F.
             03 REL2A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  REL2I  PIC X(12).
           02  FEC2L    COMP  PIC  S9(4).
           02  FEC2F    PICTURE X.
           02  FILLER REDEFINES FEC2F.
             03 FEC2A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  FEC2I  PIC X(11).
           02  TYP3L    COMP  PIC  S9(4).
           02  TYP3F    PICTURE X.
           02  FILLER REDEFINES TYP3F.
             03 TYP3A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  TYP3I  PIC X(15).
           02  MTO3L    COMP  PIC  S9(4).
           02  MTO3F    PICTURE X.
           02  FILLER REDEFINES MTO3F.
             03 MTO3A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MTO3I  PIC X(14).
           02  REL3L    COMP  PIC  S9(4).
           02  REL3F    PICTURE X.
           02  FILLER REDEFINES REL3F.
             03 REL3A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  REL3I  PIC X(12).
           02  FEC3L    COMP  PIC  S9(4).
           02  FEC3F    PICTURE X.
           02  FILLER REDEFINES FEC3F.
             03 FEC3A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  FEC3I  PIC X(11).
           02  TYP4L    COMP  PIC  S9(4).
           02  TYP4F    PICTURE X.
           02  FILLER REDEFINES TYP4F.
             03 TYP4A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  TYP4I  PIC X(15).
           02  MTO4L    COMP  PIC  S9(4).
           02  MTO4F    PICTURE X.
           02  FILLER REDEFINES MTO4F.
             03 MTO4A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MTO4I  PIC X(14).
           02  REL4L    COMP  PIC  S9(4).
           02  REL4F    PICTURE X.
           02  FILLER REDEFINES REL4F.
             03 REL4A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  REL4I  PIC X(12).
           02  FEC4L    COMP  PIC  S9(4).
           02  FEC4F    PICTURE X.
           02  FILLER REDEFINES FEC4F.
             03 FEC4A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  FEC4I  PIC X(11).
           02  MDOWNL    COMP  PIC  S9(4).
           02  MDOWNF    PICTURE X.
           02  FILLER REDEFINES MDOWNF.
             03 MDOWNA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MDOWNI  PIC X(2).
           02  MSGL    COMP  PIC  S9(4).
           02  MSGF    PICTURE X.
           02  FILLER REDEFINES MSGF.
             03 MSGA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MSGI  PIC X(77).
           02  LEYEND1L    COMP  PIC  S9(4).
           02  LEYEND1F    PICTURE X.
           02  FILLER REDEFINES LEYEND1F.
             03 LEYEND1A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LEYEND1I  PIC X(79).
           02  LEYEND2L    COMP  PIC  S9(4).
           02  LEYEND2F    PICTURE X.
           02  FILLER REDEFINES LEYEND2F.
             03 LEYEND2A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LEYEND2I  PIC X(79).
       01  BNKMAPHO REDEFINES BNKMAPHI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TITULOC    PICTURE X.
           02  TITULOH    PICTURE X.
           02  TITULOO  PIC X(32).
           02  FILLER PICTURE X(3).
           02  LBLUSERC    PICTURE X.
           02  LBLUSERH    PICTURE X.
           02  LBLUSERO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  NOMBREUSC    PICTURE X.
           02  NOMBREUSH    PICTURE X.
           02  NOMBREUSO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  LBLSALDOC    PICTURE X.
           02  LBLSALDOH    PICTURE X.
           02  LBLSALDOO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  SALDOC    PICTURE X.
           02  SALDOH    PICTURE X.
           02  SALDOO PIC $$$,$$$,$$9.99.
           02  FILLER PICTURE X(3).
           02  LIN1C    PICTURE X.
           02  LIN1H    PICTURE X.
           02  LIN1O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  SELDEPC    PICTURE X.
           02  SELDEPH    PICTURE X.
           02  SELDEPO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  SELRETC    PICTURE X.
           02  SELRETH    PICTURE X.
           02  SELRETO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  SELRECC    PICTURE X.
           02  SELRECH    PICTURE X.
           02  SELRECO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  SELTRNC    PICTURE X.
           02  SELTRNH    PICTURE X.
           02  SELTRNO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FILORDC    PICTURE X.
           02  FILORDH    PICTURE X.
           02  FILORDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  LIN2C    PICTURE X.
           02  LIN2H    PICTURE X.
           02  LIN2O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  HD_TIPOC    PICTURE X.
           02  HD_TIPOH    PICTURE X.
           02  HD_TIPOO  PIC X(14).
           02  FILLER PICTURE X(3).
           02  HD_MTOC    PICTURE X.
           02  HD_MTOH    PICTURE X.
           02  HD_MTOO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  HD_USRC    PICTURE X.
           02  HD_USRH    PICTURE X.
           02  HD_USRO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  HD_FECC    PICTURE X.
           02  HD_FECH    PICTURE X.
           02  HD_FECO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MUPC    PICTURE X.
           02  MUPH    PICTURE X.
           02  MUPO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  TYP1C    PICTURE X.
           02  TYP1H    PICTURE X.
           02  TYP1O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  MTO1C    PICTURE X.
           02  MTO1H    PICTURE X.
           02  MTO1O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  REL1C    PICTURE X.
           02  REL1H    PICTURE X.
           02  REL1O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  FEC1C    PICTURE X.
           02  FEC1H    PICTURE X.
           02  FEC1O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  TYP2C    PICTURE X.
           02  TYP2H    PICTURE X.
           02  TYP2O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  MTO2C    PICTURE X.
           02  MTO2H    PICTURE X.
           02  MTO2O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  REL2C    PICTURE X.
           02  REL2H    PICTURE X.
           02  REL2O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  FEC2C    PICTURE X.
           02  FEC2H    PICTURE X.
           02  FEC2O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  TYP3C    PICTURE X.
           02  TYP3H    PICTURE X.
           02  TYP3O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  MTO3C    PICTURE X.
           02  MTO3H    PICTURE X.
           02  MTO3O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  REL3C    PICTURE X.
           02  REL3H    PICTURE X.
           02  REL3O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  FEC3C    PICTURE X.
           02  FEC3H    PICTURE X.
           02  FEC3O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  TYP4C    PICTURE X.
           02  TYP4H    PICTURE X.
           02  TYP4O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  MTO4C    PICTURE X.
           02  MTO4H    PICTURE X.
           02  MTO4O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  REL4C    PICTURE X.
           02  REL4H    PICTURE X.
           02  REL4O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  FEC4C    PICTURE X.
           02  FEC4H    PICTURE X.
           02  FEC4O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  MDOWNC    PICTURE X.
           02  MDOWNH    PICTURE X.
           02  MDOWNO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MSGC    PICTURE X.
           02  MSGH    PICTURE X.
           02  MSGO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  LEYEND1C    PICTURE X.
           02  LEYEND1H    PICTURE X.
           02  LEYEND1O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  LEYEND2C    PICTURE X.
           02  LEYEND2H    PICTURE X.
           02  LEYEND2O  PIC X(79).
