       01  BNKMAPMI.
           02  FILLER PIC X(12).
           02  TITULOL    COMP  PIC  S9(4).
           02  TITULOF    PICTURE X.
           02  FILLER REDEFINES TITULOF.
             03 TITULOA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  TITULOI  PIC X(40).
           02  LBLUSERL    COMP  PIC  S9(4).
           02  LBLUSERF    PICTURE X.
           02  FILLER REDEFINES LBLUSERF.
             03 LBLUSERA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LBLUSERI  PIC X(20).
           02  NOMBREUSL    COMP  PIC  S9(4).
           02  NOMBREUSF    PICTURE X.
           02  FILLER REDEFINES NOMBREUSF.
             03 NOMBREUSA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  NOMBREUSI  PIC X(10).
           02  LINEA2L    COMP  PIC  S9(4).
           02  LINEA2F    PICTURE X.
           02  FILLER REDEFINES LINEA2F.
             03 LINEA2A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LINEA2I  PIC X(80).
           02  OPC1LBLL    COMP  PIC  S9(4).
           02  OPC1LBLF    PICTURE X.
           02  FILLER REDEFINES OPC1LBLF.
             03 OPC1LBLA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  OPC1LBLI  PIC X(35).
           02  OPC2LBLL    COMP  PIC  S9(4).
           02  OPC2LBLF    PICTURE X.
           02  FILLER REDEFINES OPC2LBLF.
             03 OPC2LBLA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  OPC2LBLI  PIC X(35).
           02  OPC3LBLL    COMP  PIC  S9(4).
           02  OPC3LBLF    PICTURE X.
           02  FILLER REDEFINES OPC3LBLF.
             03 OPC3LBLA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  OPC3LBLI  PIC X(35).
           02  LINEA3L    COMP  PIC  S9(4).
           02  LINEA3F    PICTURE X.
           02  FILLER REDEFINES LINEA3F.
             03 LINEA3A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LINEA3I  PIC X(80).
           02  PREGUNTAL    COMP  PIC  S9(4).
           02  PREGUNTAF    PICTURE X.
           02  FILLER REDEFINES PREGUNTAF.
             03 PREGUNTAA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  PREGUNTAI  PIC X(20).
           02  OPCIONL    COMP  PIC  S9(4).
           02  OPCIONF    PICTURE X.
           02  FILLER REDEFINES OPCIONF.
             03 OPCIONA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  OPCIONI  PIC X(1).
           02  MSGL    COMP  PIC  S9(4).
           02  MSGF    PICTURE X.
           02  FILLER REDEFINES MSGF.
             03 MSGA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MSGI  PIC X(60).
           02  LEYENDAL    COMP  PIC  S9(4).
           02  LEYENDAF    PICTURE X.
           02  FILLER REDEFINES LEYENDAF.
             03 LEYENDAA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LEYENDAI  PIC X(60).
       01  BNKMAPMO REDEFINES BNKMAPMI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TITULOC    PICTURE X.
           02  TITULOH    PICTURE X.
           02  TITULOO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  LBLUSERC    PICTURE X.
           02  LBLUSERH    PICTURE X.
           02  LBLUSERO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  NOMBREUSC    PICTURE X.
           02  NOMBREUSH    PICTURE X.
           02  NOMBREUSO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  LINEA2C    PICTURE X.
           02  LINEA2H    PICTURE X.
           02  LINEA2O  PIC X(80).
           02  FILLER PICTURE X(3).
           02  OPC1LBLC    PICTURE X.
           02  OPC1LBLH    PICTURE X.
           02  OPC1LBLO  PIC X(35).
           02  FILLER PICTURE X(3).
           02  OPC2LBLC    PICTURE X.
           02  OPC2LBLH    PICTURE X.
           02  OPC2LBLO  PIC X(35).
           02  FILLER PICTURE X(3).
           02  OPC3LBLC    PICTURE X.
           02  OPC3LBLH    PICTURE X.
           02  OPC3LBLO  PIC X(35).
           02  FILLER PICTURE X(3).
           02  LINEA3C    PICTURE X.
           02  LINEA3H    PICTURE X.
           02  LINEA3O  PIC X(80).
           02  FILLER PICTURE X(3).
           02  PREGUNTAC    PICTURE X.
           02  PREGUNTAH    PICTURE X.
           02  PREGUNTAO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  OPCIONC    PICTURE X.
           02  OPCIONH    PICTURE X.
           02  OPCIONO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MSGC    PICTURE X.
           02  MSGH    PICTURE X.
           02  MSGO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  LEYENDAC    PICTURE X.
           02  LEYENDAH    PICTURE X.
           02  LEYENDAO  PIC X(60).
